app/Controllers/OrderController.php

SELECT *
FROM `orders`
---
    public function index()
    {
        $orderModel = new OrderModel();
        $data['orders'] = $orderModel->findAll();

INSERT INTO `orders` (`product-name`, `product_id`, `product_unit_price`, `quantity`)
VALUES ('pixel camera','1','20345','1'), ('Headset','2','30454','1'), ('iphone-13','3','60000','1'), ('digital watch','4','13000','1'), ('laptop-hp','5','55000','1'), ('lipstic','6','10000','1'), ('shampoo','7','10000','1')
---
    public function store()
    {
        if ($this->request->isAJAX()) {
            $session = session();
            $orders = $this->request->getPost('data');
            $db = \Config\Database::connect();
            $builder = $db->table('orders');
            $builder->insertBatch($orders);