app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function cart()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();

SELECT *
FROM `products`
WHERE `products`.`id` = '1'
---
    public function show($id)
    {
        $productModel = new ProductModel();
        $data['product'] = $productModel->find($id);